# Aplication train assignment

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [142]:
df = pd.read_csv("C:/Users/PRASADH/OneDrive/Desktop/data sets/insurance/project-1/application_train.csv")

In [143]:
df['AMT_INCOME_TOTAL'].mean()

168797.9192969845

In [144]:
df['AMT_INCOME_TOTAL'].std()

237123.14627883647

In [147]:
np.array([0,10,100,12]).mean()

30.5

In [149]:
np.array([0,10,100,12]).std()

40.382545734512576

In [31]:
df.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [4]:
df.shape      #### here, total coloms is 122

(307511, 122)

## getting numeric coloms table

In [37]:
numeric_df =df._get_numeric_data()    ###3 for getting only numerical coloms

In [38]:
numeric_df

,SK_ID_CURR,TARGET,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,REGION_POPULATION_RELATIVE,DAYS_BIRTH,DAYS_EMPLOYED,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,0,202500.0,406597.5,24700.5,351000.0,0.018801,-9461,-637,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,0,270000.0,1293502.5,35698.5,1129500.0,0.003541,-16765,-1188,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,0,67500.0,135000.0,6750.0,135000.0,0.010032,-19046,-225,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,0,135000.0,312682.5,29686.5,297000.0,0.008019,-19005,-3039,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,0,121500.0,513000.0,21865.5,513000.0,0.028663,-19932,-3038,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
307506,456251,0,0,157500.0,254700.0,27558.0,225000.0,0.032561,-9327,-236,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307507,456252,0,0,72000.0,269550.0,12001.5,225000.0,0.025164,-20775,365243,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307508,456253,0,0,153000.0,677664.0,29979.0,585000.0,0.005002,-14966,-7921,...,0,0,0,0,1.0,0.0,0.0,1.0,0.0,1.0
307509,456254,1,0,171000.0,370107.0,20205.0,319500.0,0.005313,-11961,-4786,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
307510,456255,0,0,157500.0,675000.0,49117.5,675000.0,0.046220,-16856,-1262,...,0,0,0,0,0.0,0.0,0.0,2.0,0.0,1.0

In [40]:
numeric_df.shape         ### numeric table

(307511, 106)

### getting non_numeric coloms table

In [41]:
df.sample(10000).describe(include='object').columns       ### for getting non numerical coloms

Index(['NAME_CONTRACT_TYPE', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY',
       'NAME_TYPE_SUITE', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'OCCUPATION_TYPE',
       'WEEKDAY_APPR_PROCESS_START', 'ORGANIZATION_TYPE', 'FONDKAPREMONT_MODE',
       'HOUSETYPE_MODE', 'WALLSMATERIAL_MODE', 'EMERGENCYSTATE_MODE'],
      dtype='object')

In [42]:
df.sample(10000).describe(include='object').columns.shape      ### here, non-numeric data coloms are 16 outoff 122

(16,)

In [43]:
non_numeric_df =df[df.describe(include="object").columns]          ### here, we get only 16 non-numeric coloms data

In [44]:
non_numeric_df

,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,NAME_TYPE_SUITE,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,OCCUPATION_TYPE,WEEKDAY_APPR_PROCESS_START,ORGANIZATION_TYPE,FONDKAPREMONT_MODE,HOUSETYPE_MODE,WALLSMATERIAL_MODE,EMERGENCYSTATE_MODE
0,Cash loans,M,N,Y,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,Laborers,WEDNESDAY,Business Entity Type 3,reg oper account,block of flats,"Stone, brick",No
1,Cash loans,F,N,N,Family,State servant,Higher education,Married,House / apartment,Core staff,MONDAY,School,reg oper account,block of flats,Block,No
2,Revolving loans,M,Y,Y,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,Laborers,MONDAY,Government,NaN,NaN,NaN,NaN
3,Cash loans,F,N,Y,Unaccompanied,Working,Secondary / secondary special,Civil marriage,House / apartment,Laborers,WEDNESDAY,Business Entity Type 3,NaN,NaN,NaN,NaN
4,Cash loans,M,N,Y,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,Core staff,THURSDAY,Religion,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
307506,Cash loans,M,N,N,Unaccompanied,Working,Secondary / secondary special,Separated,With parents,Sales staff,THURSDAY,Services,reg oper account,block of flats,"Stone, brick",No
307507,Cash loans,F,N,Y,Unaccompanied,Pensioner,Secondary / secondary special,Widow,House / apartment,NaN,MONDAY,XNA,reg oper account,block of flats,"Stone, brick",No
307508,Cash loans,F,N,Y,Unaccompanied,Working,Higher education,Separated,House / apartment,Managers,THURSDAY,School,reg oper account,block of flats,Panel,No
307509,Cash loans,F,N,Y,Unaccompanied,Commercial associate,Secondary / secondary special,Married,House / apartment,Laborers,WEDNESDAY,Business Entity Type 1,NaN,block of flats,"Stone, brick",No
307510,Cash loans,F,N,N,Unaccompanied,Commercial associate,Higher education,Married,House / apartment,Laborers,THURSDAY,Business Entity Type 3,NaN,block of flats,Panel,No

In [44]:
non_numeric_df.shape            ### here, we got non_numeric data table

(307511, 16)

## checking max 5 numeric coloms having null values

In [46]:
numeric_df.head()

,SK_ID_CURR,TARGET,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,REGION_POPULATION_RELATIVE,DAYS_BIRTH,DAYS_EMPLOYED,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,0,202500.0,406597.5,24700.5,351000.0,0.018801,-9461,-637,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,0,270000.0,1293502.5,35698.5,1129500.0,0.003541,-16765,-1188,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,0,67500.0,135000.0,6750.0,135000.0,0.010032,-19046,-225,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,0,135000.0,312682.5,29686.5,297000.0,0.008019,-19005,-3039,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,0,121500.0,513000.0,21865.5,513000.0,0.028663,-19932,-3038,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [39]:
Numeric_Null =numeric_df.isna().sum()

In [40]:
Numeric_Null

SK_ID_CURR                        0
TARGET                            0
CNT_CHILDREN                      0
AMT_INCOME_TOTAL                  0
AMT_CREDIT                        0
                              ...
AMT_REQ_CREDIT_BUREAU_DAY     41519
AMT_REQ_CREDIT_BUREAU_WEEK    41519
AMT_REQ_CREDIT_BUREAU_MON     41519
AMT_REQ_CREDIT_BUREAU_QRT     41519
AMT_REQ_CREDIT_BUREAU_YEAR    41519
Length: 106, dtype: int64

In [20]:
Numeric_Null[Numeric_Null > 200000]

OWN_CAR_AGE                 202929
YEARS_BUILD_AVG             204488
COMMONAREA_AVG              214865
FLOORSMIN_AVG               208642
LIVINGAPARTMENTS_AVG        210199
NONLIVINGAPARTMENTS_AVG     213514
YEARS_BUILD_MODE            204488
COMMONAREA_MODE             214865
FLOORSMIN_MODE              208642
LIVINGAPARTMENTS_MODE       210199
NONLIVINGAPARTMENTS_MODE    213514
YEARS_BUILD_MEDI            204488
COMMONAREA_MEDI             214865
FLOORSMIN_MEDI              208642
LIVINGAPARTMENTS_MEDI       210199
NONLIVINGAPARTMENTS_MEDI    213514
dtype: int64

In [22]:
len(Numeric_Null[Numeric_Null > 200000])

16

In [ ]:
sort_values(assending=False)

In [48]:
numeric_df.isna().sum().sort_values().tail()

NONLIVINGAPARTMENTS_MEDI    213514
NONLIVINGAPARTMENTS_AVG     213514
COMMONAREA_AVG              214865
COMMONAREA_MEDI             214865
COMMONAREA_MODE             214865
dtype: int64

## checking max 5 non_numeric coloms having null values

In [74]:
non_numeric_df.head()

,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,NAME_TYPE_SUITE,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,OCCUPATION_TYPE,WEEKDAY_APPR_PROCESS_START,ORGANIZATION_TYPE,FONDKAPREMONT_MODE,HOUSETYPE_MODE,WALLSMATERIAL_MODE,EMERGENCYSTATE_MODE
0,Cash loans,M,N,Y,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,Laborers,WEDNESDAY,Business Entity Type 3,reg oper account,block of flats,"Stone, brick",No
1,Cash loans,F,N,N,Family,State servant,Higher education,Married,House / apartment,Core staff,MONDAY,School,reg oper account,block of flats,Block,No
2,Revolving loans,M,Y,Y,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,Laborers,MONDAY,Government,NaN,NaN,NaN,NaN
3,Cash loans,F,N,Y,Unaccompanied,Working,Secondary / secondary special,Civil marriage,House / apartment,Laborers,WEDNESDAY,Business Entity Type 3,NaN,NaN,NaN,NaN
4,Cash loans,M,N,Y,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,Core staff,THURSDAY,Religion,NaN,NaN,NaN,NaN

In [45]:
non_numeric_df.isna().sum()

NAME_CONTRACT_TYPE                 0
CODE_GENDER                        0
FLAG_OWN_CAR                       0
FLAG_OWN_REALTY                    0
NAME_TYPE_SUITE                 1292
NAME_INCOME_TYPE                   0
NAME_EDUCATION_TYPE                0
NAME_FAMILY_STATUS                 0
NAME_HOUSING_TYPE                  0
OCCUPATION_TYPE                96391
WEEKDAY_APPR_PROCESS_START         0
ORGANIZATION_TYPE                  0
FONDKAPREMONT_MODE            210295
HOUSETYPE_MODE                154297
WALLSMATERIAL_MODE            156341
EMERGENCYSTATE_MODE           145755
dtype: int64

In [46]:
null_non_numeric = non_numeric_df.isna().sum()

In [47]:
null_non_numeric[null_non_numeric > 90000]

OCCUPATION_TYPE         96391
FONDKAPREMONT_MODE     210295
HOUSETYPE_MODE         154297
WALLSMATERIAL_MODE     156341
EMERGENCYSTATE_MODE    145755
dtype: int64

In [49]:
non_numeric_df.isna().sum().sort_values().tail()

OCCUPATION_TYPE         96391
EMERGENCYSTATE_MODE    145755
HOUSETYPE_MODE         154297
WALLSMATERIAL_MODE     156341
FONDKAPREMONT_MODE     210295
dtype: int64

## filling Null values in top 5 null-numeric coloms with median

In [50]:
numeric_df.isna().sum().sort_values().tail()

NONLIVINGAPARTMENTS_MEDI    213514
NONLIVINGAPARTMENTS_AVG     213514
COMMONAREA_AVG              214865
COMMONAREA_MEDI             214865
COMMONAREA_MODE             214865
dtype: int64

In [52]:
numeric_df["NONLIVINGAPARTMENTS_MEDI"].fillna(numeric_df["NONLIVINGAPARTMENTS_MEDI"].median(), inplace=True)     
numeric_df["NONLIVINGAPARTMENTS_AVG"].fillna(numeric_df["NONLIVINGAPARTMENTS_AVG"].median(), inplace=True)
numeric_df["COMMONAREA_AVG"].fillna(numeric_df["COMMONAREA_AVG"].median(), inplace=True)
numeric_df["COMMONAREA_MEDI"].fillna(numeric_df["COMMONAREA_MEDI"].median(), inplace=True)
numeric_df["COMMONAREA_MODE"].fillna(numeric_df["COMMONAREA_MODE"].median(), inplace=True)

In [ ]:
## just verifying

In [53]:
df["COMMONAREA_AVG"].isna().sum()    ## but here, we checking in main data set, here also committed

0

In [55]:
df["NONLIVINGAPARTMENTS_AVG"].isna().sum()

0

In [56]:
df["COMMONAREA_MODE"].isna().sum()

0

In [57]:
df["COMMONAREA_MEDI"].isna().sum()

0

In [54]:
df["NONLIVINGAPARTMENTS_MEDI"].isna().sum()

0

In [58]:
numeric_df.isna().sum().sort_values().tail()   ### see here next 5 came

FLOORSMIN_MODE              208642
LIVINGAPARTMENTS_MEDI       210199
LIVINGAPARTMENTS_MODE       210199
LIVINGAPARTMENTS_AVG        210199
NONLIVINGAPARTMENTS_MODE    213514
dtype: int64

## filling Null values in top 5 null-non_numeric coloms with mode

In [84]:
non_numeric_df.isna().sum().sort_values().tail()

OCCUPATION_TYPE         96391
EMERGENCYSTATE_MODE    145755
HOUSETYPE_MODE         154297
WALLSMATERIAL_MODE     156341
FONDKAPREMONT_MODE     210295
dtype: int64

In [98]:
df["OCCUPATION_TYPE"].value_counts()

Laborers                 151577
Sales staff               32102
Core staff                27570
Managers                  21371
Drivers                   18603
High skill tech staff     11380
Accountants                9813
Medicine staff             8537
Security staff             6721
Cooking staff              5946
Cleaning staff             4653
Private service staff      2652
Low-skill Laborers         2093
Waiters/barmen staff       1348
Secretaries                1305
Realty agents               751
HR staff                    563
IT staff                    526
Name: OCCUPATION_TYPE, dtype: int64

In [99]:
df["OCCUPATION_TYPE"].value_counts().head()

Laborers       151577
Sales staff     32102
Core staff      27570
Managers        21371
Drivers         18603
Name: OCCUPATION_TYPE, dtype: int64

In [100]:
df["OCCUPATION_TYPE"][0]

'Laborers'

In [101]:
df["OCCUPATION_TYPE"].value_counts().index[0]   ###3 so we have to fill with this

'Laborers'

In [115]:
df["OCCUPATION_TYPE"].mode()

0    Laborers
Name: OCCUPATION_TYPE, dtype: object

In [116]:
df["OCCUPATION_TYPE"].mode()[0]

'Laborers'

In [114]:
type(df["OCCUPATION_TYPE"].mode())

pandas.core.series.Series

In [104]:
df["OCCUPATION_TYPE"].fillna(df["OCCUPATION_TYPE"].value_counts().index[0], inplace=True)     
df["EMERGENCYSTATE_MODE"].fillna(df["EMERGENCYSTATE_MODE"].value_counts().index[0], inplace=True)
df["HOUSETYPE_MODE"].fillna(df["HOUSETYPE_MODE"].value_counts().index[0], inplace=True)
df["WALLSMATERIAL_MODE"].fillna(df["WALLSMATERIAL_MODE"].value_counts().index[0], inplace=True)
df["FONDKAPREMONT_MODE"].fillna(df["FONDKAPREMONT_MODE"].value_counts().index[0], inplace=True)

In [89]:
## just verifying

In [102]:
df["OCCUPATION_TYPE"].isna().sum()

0

In [105]:
df["EMERGENCYSTATE_MODE"].isna().sum()

0

In [106]:
df["HOUSETYPE_MODE"].isna().sum()

0

In [107]:
df["WALLSMATERIAL_MODE"].isna().sum()

0

In [108]:
df["FONDKAPREMONT_MODE"].isna().sum()

0

## Printing Discriptive Statistics for a particular numeric colom

In [ ]:
## i taken "AMT_INCOME_TOTAL" colom for printing Discriptive Statistics

In [117]:
df["AMT_INCOME_TOTAL"].mean()

168797.9192969845

In [118]:
df["AMT_INCOME_TOTAL"].mode()

0    135000.0
Name: AMT_INCOME_TOTAL, dtype: float64

In [120]:
df["AMT_INCOME_TOTAL"].unique()

array([202500. , 270000. ,  67500. , ...,  96768. , 546250.5, 113062.5])

In [121]:
df["AMT_INCOME_TOTAL"].nunique()

2548

In [122]:
df["AMT_INCOME_TOTAL"].value_counts()   ### here,  135000 presants 35750 times,  so this is mode of this colom

135000.0    35750
112500.0    31019
157500.0    26556
180000.0    24719
90000.0     22483
            ...
117324.0        1
64584.0         1
142897.5        1
109170.0        1
113062.5        1
Name: AMT_INCOME_TOTAL, Length: 2548, dtype: int64

In [126]:
df["AMT_INCOME_TOTAL"].mean()

168797.9192969845

In [129]:
df["AMT_INCOME_TOTAL"].std()

237123.14627883647

In [130]:
df.shape

(307511, 122)

In [132]:
df["AMT_INCOME_TOTAL"].isna().sum()

0

In [140]:
df["AMT_INCOME_TOTAL"].std(skipna=False)

237123.14627885626

In [141]:
df["AMT_INCOME_TOTAL"].mean(skipna=False)

168797.9192969845

### insights from this particular colom

In [ ]:
The total avg income is = 168797.9192969845

lower range for total avg income = 168797.9192969845 - 237123.14627885626 = -68325.22698187176

upper range for total avg income = 168797.9192969845 + 237123.14627885626 = 405921.06557584077